app/Controllers/CartController.php

    public function cartView()
    {
        $cartModel = new CartModel();
        $session = session();
        $userId = $session->get('user_id');
        $carts = $cartModel
            ->join('products', 'products.product_id = cart.product_id')
            ->where('user_id', $userId)
            ->where('status', 'cart')
            ->where('cart.deleted_at', null)
            ->findAll();

        $fileModel = new FileModel();
        $totalPrice = 0;
        foreach ($carts as &$cart) {
            $image = $fileModel
                ->where('product_id', $cart['product_id'])
                ->first();
---
SELECT *
FROM `cart`
JOIN `products` ON `products`.`product_id` = `cart`.`product_id`
WHERE `user_id` = '3'
AND `status` = 'cart'
AND `cart`.`deleted_at` IS NULL
SELECT *
FROM `files`
WHERE `product_id` = '3'
 LIMIT 1

    public function getCart()
    {
        $cartModel = new CartModel();
        $session = session();
        $userId = $session->get('user_id');
        $carts = $cartModel
            ->where('user_id', $userId)
            ->where('status', 'cart')
            ->findAll();
---
SELECT *
FROM `cart`
WHERE `user_id` = '3'
AND `status` = 'cart'

    public function addToCart($productId)
    {
        helper(['form', 'url']);
        $cartModel = new CartModel();
        $session = session();
        $userId = $session->get('user_id');
        if (!$userId) {
            return redirect()->to(base_url('/login?redirectTo=/product/' . $productId));
        }
        $cartItem = [
            'product_id' => $productId,
            'size_id' => 1,
            'user_id' => $userId,
            'status' => 'cart',
            'deleted_at' => null
        ];
        if ($cartModel->save($cartItem)) {
---
INSERT INTO `cart` (`product_id`, `size_id`, `user_id`, `status`, `deleted_at`, `created_at`, `updated_at`) VALUES ('3', 1, '3', 'cart', NULL, '2025-01-10 19:10:13', '2025-01-10 19:10:13')