app/Controllers/HomeController.php

    public function index(): string
    {
        $productModel = new ProductModel();
        $fileModel = new FileModel();

        $topSelling = $productModel
            ->join('categories', 'categories.category_id = products.category_id')
            ->join("brands", "brands.brand_id = products.brand_id")
            ->where('products.deleted_at', null)
            ->findAll();

        foreach ($topSelling as &$t) {
            $imageTopSelling = $fileModel
                ->where('product_id', $t['product_id'])
                ->where('deleted_at', null)
                ->first();

            $t['file_path'] = $imageTopSelling['file_path'] ?? null;
        }

        $newArrival = $productModel
            ->join('categories', 'categories.category_id = products.category_id')
            ->join("brands", "brands.brand_id = products.brand_id")
            ->where('category_name', 'new_arrival')
            ->where('products.deleted_at', null)
            ->findAll();
---
SELECT *
FROM `products`
JOIN `categories` ON `categories`.`category_id` = `products`.`category_id`
JOIN `brands` ON `brands`.`brand_id` = `products`.`brand_id`
WHERE `products`.`deleted_at` IS NULL
SELECT *
FROM `files`
WHERE `product_id` = '1'
AND `deleted_at` IS NULL
 LIMIT 1
SELECT *
FROM `products`
JOIN `categories` ON `categories`.`category_id` = `products`.`category_id`
JOIN `brands` ON `brands`.`brand_id` = `products`.`brand_id`
WHERE `category_name` = 'new_arrival'
AND `products`.`deleted_at` IS NULL