app/Controllers/PaymentController.php

UPDATE `cart` SET `status` = 'success_payment', `updated_at` = '2025-01-10 19:00:58'
WHERE `user_id` = '3'
AND `status` = 'cart'
---
    public function payment()
    {
        $cartModel = new CartModel();
        $session = session();
        $userId = $session->get('user_id');

        // Save payment data
        $data = [
            'user_id' => $userId,
            'total' => $this->request->getVar('total_price'),
            'status' => 'waitiing_confirmation',
            'deleted_at' => null
        ];

        $cartModel
            ->where('user_id', $userId)
            ->where('status', 'cart')
            ->set(['status' => 'success_payment'])
            ->update();