app/Controllers/ProductController.php

SELECT *
FROM `products`
JOIN `categories` ON `categories`.`category_id` = `products`.`category_id`
WHERE `products`.`deleted_at` IS NULL
---
    public function manageProduct(): string
    {
        $productModel = new ProductModel();
        $product = $productModel
            ->join('categories', 'categories.category_id = products.category_id')
            ->where('products.deleted_at', null)
            ->findAll();